# Question

You're given a dataframe containing a list of user IDs and their full names (e.g. 'James Emerson').

Transform this dataframe into a dataframe that contains the user ids and only the first name of each user.

# Solution 1

In [1]:
import pandas as pd

users = {"user_id" : [1034, 9430, 7281, 5264, 8995], 
         "full_name" : ["James Emerson", "Fiona Woodward", "Alvin Gross", "Deborah Handler", "Leah Xue"]}

users_df = pd.DataFrame(users)
users_df

   user_id        full_name
0     1034    James Emerson
1     9430   Fiona Woodward
2     7281      Alvin Gross
3     5264  Deborah Handler
4     8995         Leah Xue

In [2]:
users_df1= users_df

In [3]:
users_df1['full_name']=users_df1['full_name'].apply(lambda x: x.split()[0])

In [4]:
users_df1

   user_id full_name
0     1034     James
1     9430     Fiona
2     7281     Alvin
3     5264   Deborah
4     8995      Leah

## Solution 2

In [10]:
users2 = {"user_id" : [1034, 9430, 7281, 5264, 8995], 
         "full_name" : ["James Emerson", "Fiona Woodward", "Alvin Gross", "Deborah Handler", "Leah Xue"]}

users_df2 = pd.DataFrame(users2)
users_df2

   user_id        full_name
0     1034    James Emerson
1     9430   Fiona Woodward
2     7281      Alvin Gross
3     5264  Deborah Handler
4     8995         Leah Xue

In [11]:
users_df2['first_name'] = users_df2['full_name'].str.split(' ').str[0]
users_df2

   user_id        full_name first_name
0     1034    James Emerson      James
1     9430   Fiona Woodward      Fiona
2     7281      Alvin Gross      Alvin
3     5264  Deborah Handler    Deborah
4     8995         Leah Xue       Leah

In [12]:
users_df2.drop(columns = ['full_name'],inplace=True)
users_df2

   user_id first_name
0     1034      James
1     9430      Fiona
2     7281      Alvin
3     5264    Deborah
4     8995       Leah